{
    "@odata.type":  "#microsoft.graph.androidDeviceOwnerCompliancePolicy",
    "roleScopeTagIds":  [
                            "0"
                        ],
    "id":  "e710eba2-6826-4ccd-984c-acc53f769ed8",
    "createdDateTime":  "2022-04-21T13:01:33.4577966Z",
    "description":  null,
    "lastModifiedDateTime":  "2022-04-21T13:01:33.4577966Z",
    "displayName":  "Compliance_Android_Corporate_Password",
    "version":  1,
    "deviceThreatProtectionEnabled":  false,
    "deviceThreatProtectionRequiredSecurityLevel":  "unavailable",
    "advancedThreatProtectionRequiredSecurityLevel":  "unavailable",
    "securityRequireSafetyNetAttestationBasicIntegrity":  false,
    "securityRequireSafetyNetAttestationCertifiedDevice":  false,
    "osMinimumVersion":  null,
    "osMaximumVersion":  null,
    "minAndroidSecurityPatchLevel":  null,
    "passwordRequired":  true,
    "passwordMinimumLength":  6,
    "passwordMinimumLetterCharacters":  null,
    "passwordMinimumLowerCaseCharacters":  null,
    "passwordMinimumNonLetterCharacters":  null,
    "passwordMinimumNumericCharacters":  null,
    "passwordMinimumSymbolCharacters":  null,
    "passwordMinimumUpperCaseCharacters":  null,
    "passwordRequiredType":  "numericComplex",
    "passwordMinutesOfInactivityBeforeLock":  5,
    "passwordExpirationDays":  null,
    "passwordPreviousPasswordCountToBlock":  null,
    "storageRequireEncryption":  null,
    "securityRequireIntuneAppIntegrity":  null
}
