{
  "@odata.type": "#microsoft.graph.androidWorkProfileCompliancePolicy",
  "roleScopeTagIds": [
    "0"
  ],
  "id": "ba399f74-1a4c-47f1-bc72-54c48f322341",
  "createdDateTime": "2023-01-04T13:56:42.5587922Z",
  "description": "",
  "lastModifiedDateTime": "2023-01-04T13:56:54.0081587Z",
  "displayName": "Compliance_Android_Personal_CE_Additional_Controls",
  "version": 2,
  "passwordRequired": false,
  "passwordMinimumLength": null,
  "passwordRequiredType": "deviceDefault",
  "requiredPasswordComplexity": "none",
  "passwordMinutesOfInactivityBeforeLock": null,
  "passwordExpirationDays": null,
  "passwordPreviousPasswordBlockCount": null,
  "passwordSignInFailureCountBeforeFactoryReset": null,
  "securityPreventInstallAppsFromUnknownSources": true,
  "securityDisableUsbDebugging": true,
  "securityRequireVerifyApps": false,
  "deviceThreatProtectionEnabled": false,
  "deviceThreatProtectionRequiredSecurityLevel": "unavailable",
  "advancedThreatProtectionRequiredSecurityLevel": "unavailable",
  "securityBlockJailbrokenDevices": true,
  "osMinimumVersion": null,
  "osMaximumVersion": null,
  "minAndroidSecurityPatchLevel": null,
  "storageRequireEncryption": false,
  "securityRequireSafetyNetAttestationBasicIntegrity": false,
  "securityRequireSafetyNetAttestationCertifiedDevice": false,
  "securityRequireGooglePlayServices": true,
  "securityRequireUpToDateSecurityProviders": true,
  "securityRequireCompanyPortalAppIntegrity": true,
  "securityRequiredAndroidSafetyNetEvaluationType": "basic"
}
