{
    "@odata.type":  "#microsoft.graph.iosCompliancePolicy",
    "roleScopeTagIds":  [
                            "0"
                        ],
    "id":  "ba5c6077-1e6e-4ebb-a296-95c3037787dd",
    "createdDateTime":  "2022-05-05T14:56:17.6408774Z",
    "description":  null,
    "lastModifiedDateTime":  "2022-05-06T11:19:47.6446322Z",
    "displayName":  "Compliance_iOS_Personal_OS_16",
    "version":  3,
    "passcodeBlockSimple":  false,
    "passcodeExpirationDays":  null,
    "passcodeMinimumLength":  null,
    "passcodeMinutesOfInactivityBeforeLock":  null,
    "passcodeMinutesOfInactivityBeforeScreenTimeout":  null,
    "passcodePreviousPasscodeBlockCount":  null,
    "passcodeMinimumCharacterSetCount":  null,
    "passcodeRequiredType":  "deviceDefault",
    "passcodeRequired":  false,
    "osMinimumVersion":  "16.1",
    "osMaximumVersion":  "16.99.99",
    "osMinimumBuildVersion":  null,
    "osMaximumBuildVersion":  null,
    "securityBlockJailbrokenDevices":  false,
    "deviceThreatProtectionEnabled":  false,
    "deviceThreatProtectionRequiredSecurityLevel":  "unavailable",
    "advancedThreatProtectionRequiredSecurityLevel":  "unavailable",
    "managedEmailProfileRequired":  false,
    "restrictedApps":  [

                       ],
    "scheduledActionsForRule": [
      {
        "ruleName": "blockAction",
        "scheduledActionConfigurations": [
          {
            "actionType": "block",
            "gracePeriodHours": 336,
            "notificationTemplateId": ""
          }
        ]
      }
    ]
  }
