{
  "@odata.type": "#microsoft.graph.iosCompliancePolicy",
  "roleScopeTagIds": [
    "0"
  ],
  "id": "1c3dc666-8c1b-4dab-92ad-8aa3c9854861",
  "createdDateTime": "2023-01-04T13:58:03.7877736Z",
  "description": null,
  "lastModifiedDateTime": "2023-01-04T13:58:03.7877736Z",
  "displayName": "Compliance_iOS_Corporate_CE_Additional_Controls",
  "version": 1,
  "passcodeBlockSimple": false,
  "passcodeExpirationDays": null,
  "passcodeMinimumLength": null,
  "passcodeMinutesOfInactivityBeforeLock": null,
  "passcodeMinutesOfInactivityBeforeScreenTimeout": null,
  "passcodePreviousPasscodeBlockCount": null,
  "passcodeMinimumCharacterSetCount": null,
  "passcodeRequiredType": "deviceDefault",
  "passcodeRequired": false,
  "osMinimumVersion": null,
  "osMaximumVersion": null,
  "osMinimumBuildVersion": null,
  "osMaximumBuildVersion": null,
  "securityBlockJailbrokenDevices": true,
  "deviceThreatProtectionEnabled": false,
  "deviceThreatProtectionRequiredSecurityLevel": "unavailable",
  "advancedThreatProtectionRequiredSecurityLevel": "unavailable",
  "managedEmailProfileRequired": false,
  "restrictedApps": []
}
