{
    "@odata.type":  "#microsoft.graph.iosCompliancePolicy",
    "roleScopeTagIds":  [
                            "0"
                        ],
    "id":  "861b02bd-9458-4cad-860a-f15bde4665ea",
    "createdDateTime":  "2022-05-05T14:57:53.8071146Z",
    "description":  null,
    "lastModifiedDateTime":  "2022-05-06T11:20:09.1264458Z",
    "displayName":  "Compliance_iOS_Corporate_OS_15",
    "version":  2,
    "passcodeBlockSimple":  false,
    "passcodeExpirationDays":  null,
    "passcodeMinimumLength":  null,
    "passcodeMinutesOfInactivityBeforeLock":  null,
    "passcodeMinutesOfInactivityBeforeScreenTimeout":  null,
    "passcodePreviousPasscodeBlockCount":  null,
    "passcodeMinimumCharacterSetCount":  null,
    "passcodeRequiredType":  "deviceDefault",
    "passcodeRequired":  false,
    "osMinimumVersion":  "15.7.1",
    "osMaximumVersion":  "15.99.99",
    "osMinimumBuildVersion":  null,
    "osMaximumBuildVersion":  null,
    "securityBlockJailbrokenDevices":  false,
    "deviceThreatProtectionEnabled":  false,
    "deviceThreatProtectionRequiredSecurityLevel":  "unavailable",
    "advancedThreatProtectionRequiredSecurityLevel":  "unavailable",
    "managedEmailProfileRequired":  false,
    "restrictedApps":  [

                       ],
    "scheduledActionsForRule": [
      {
        "ruleName": "blockAction",
        "scheduledActionConfigurations": [
          {
            "actionType": "block",
            "gracePeriodHours": 336,
            "notificationTemplateId": ""
          }
        ]
      }
    ]
  }
