{
  "@odata.type": "#microsoft.graph.iosCompliancePolicy",
  "roleScopeTagIds": [
    "0"
  ],
  "id": "5a0be02f-b46d-497f-9cda-328817c06070",
  "createdDateTime": "2023-01-04T13:57:46.2071035Z",
  "description": null,
  "lastModifiedDateTime": "2023-01-04T13:57:46.2071035Z",
  "displayName": "Compliance_iOS_Personal_CE_Additional_Controls",
  "version": 1,
  "passcodeBlockSimple": false,
  "passcodeExpirationDays": null,
  "passcodeMinimumLength": null,
  "passcodeMinutesOfInactivityBeforeLock": null,
  "passcodeMinutesOfInactivityBeforeScreenTimeout": null,
  "passcodePreviousPasscodeBlockCount": null,
  "passcodeMinimumCharacterSetCount": null,
  "passcodeRequiredType": "deviceDefault",
  "passcodeRequired": false,
  "osMinimumVersion": null,
  "osMaximumVersion": null,
  "osMinimumBuildVersion": null,
  "osMaximumBuildVersion": null,
  "securityBlockJailbrokenDevices": true,
  "deviceThreatProtectionEnabled": false,
  "deviceThreatProtectionRequiredSecurityLevel": "unavailable",
  "advancedThreatProtectionRequiredSecurityLevel": "unavailable",
  "managedEmailProfileRequired": false,
  "restrictedApps": []
}
