{
    "@odata.type":  "#microsoft.graph.windows10CustomConfiguration",
    "id":  "af5a9765-04b0-4409-a6d4-d713d333879b",
    "lastModifiedDateTime":  "2022-03-24T12:29:02.2116256Z",
    "roleScopeTagIds":  [
                            "0"
                        ],
    "supportsScopeTags":  true,
    "deviceManagementApplicabilityRuleOsEdition":  null,
    "deviceManagementApplicabilityRuleOsVersion":  null,
    "deviceManagementApplicabilityRuleDeviceMode":  null,
    "createdDateTime":  "2022-03-24T12:29:02.2116256Z",
    "description":  "Skips the User Enrolment Status Page to speed up the enrolment process.",
    "displayName":  "Configuration_Windows_Corporate_Autopilot_Skip_User_ESP",
    "version":  1,
    "omaSettings":  [
                        {
                            "@odata.type":  "#microsoft.graph.omaSettingBoolean",
                            "displayName":  "Skip User ESP",
                            "description":  null,
                            "omaUri":  "./Device/Vendor/MSFT/DMClient/Provider/MS DM Server/FirstSyncStatus/SkipUserStatusPage",
                            "secretReferenceValueId":  null,
                            "isEncrypted":  false,
                            "value":  true
                        }
                    ]
}
